In [1]:
import pandas as pd
df = pd.DataFrame({'Col1': [10, 20, 15, 30, 45],
                   'Col2': [13, 23, 18, 33, 48],
                   'Col3': [17, 27, 22, 37, 52]})

In [9]:
df.shift(periods=3)

   Col1  Col2  Col3
0   NaN   NaN   NaN
1   NaN   NaN   NaN
2   NaN   NaN   NaN
3  10.0  13.0  17.0
4  20.0  23.0  27.0

In [6]:
df.shift(periods=1, axis='columns')

   Col1  Col2  Col3
0   NaN  10.0  13.0
1   NaN  20.0  23.0
2   NaN  15.0  18.0
3   NaN  30.0  33.0
4   NaN  45.0  48.0

In [10]:
df.shift(periods=3, fill_value = 1)

   Col1  Col2  Col3
0     1     1     1
1     1     1     1
2     1     1     1
3    10    13    17
4    20    23    27

In [39]:
from datetime import datetime

date = "02-20-2002"

date_formatted = datetime.strptime(date, "%M-%d-%Y")
date_formatted = date_to_date.strftime("%Y-%M-%d")

print(date_formatted)

2002-02-20